sheldon123z/EFR32-embedded-provisioner/app.c
/***************************************************************************//**
 * @file
 * @brief Application code
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

/* C Standard Library headers */
#include <stdio.h>

/* Bluetooth stack headers */
#include "bg_types.h"
#include "native_gecko.h"
#include "gatt_db.h"
#include "mesh_generic_model_capi_types.h"
#include "mesh_lib.h"

/* GPIO peripheral library */
#include <em_gpio.h>


/* Display Interface header */
#include "display_interface.h"

/* LED driver with support for PWM dimming */
#include "led_driver.h"

/* Own header */
#include "app.h"

#include <string.h>

/***********************************************************************************************//**
 * @addtogroup Application
 * @{
 **************************************************************************************************/

/***********************************************************************************************//**
 * @addtogroup app
 * @{
 **************************************************************************************************/

/*******************************************************************************
 * Timer handles defines.
 * System control Timer up to 32 (0-31)
 * Provisioning process Timer up to 64 (32 - 95)
 * Remote control Timer up to 32  (96 - 127)
 * Reserved for future Timer 128  (128 - 255)
 ******************************************************************************/

// uncomment this to enable configuration of vendor model
//#define CONFIGURE_VENDOR_MODEL

// uncomment this to enable provisioning using PB-GATT (PB-ADV is used by default)
//#define PROVISION_OVER_GATT

// uncomment this to use fixed network and application keys (for debugging only)
#define USE_FIXED_KEYS

// uncomment this to control the Light node from provisioner or get the request from Switch
#define REMOTE_ONOFF_CTL_FROM_PROV

#define TIMER_ID_GET_DCD        20
#define TIMER_ID_APPKEY_ADD     21
#define TIMER_ID_APPKEY_BIND    22
#define TIMER_ID_PUB_SET        23
#define TIMER_ID_SUB_ADD        24

#define TIMER_ID_SEND_PUB_MSG   25


#define TIMER_ID_SYS_FACTORY_RESET  1
#define TIMER_ID_SYS_RESTART        2
#define TIMER_ID_SYS_BUTTON_POLL    3

#define ONOFF_TIMER_ID_RETRANS 4

/// Flag for indicating DFU Reset must be performed
//static uint8_t boot_to_dfu = 0;
/// Address of the Primary Element of the Node
//static uint16 _my_address = 0;
/// Number of active Bluetooth connections
static uint8 num_connections = 0;
/// Handle of the last opened LE connection
static uint8 conn_handle = 0xFF;
/// Flag for indicating that initialization was performed
//static uint8 init_done = 0;


/** global variables */

/** Timer Frequency used. */
#define TIMER_CLK_FREQ ((uint32)32768)
/** Convert msec to timer ticks. */
#define TIMER_MS_2_TIMERTICK(ms) ((TIMER_CLK_FREQ * ms) / 1000)

enum {
  init,
  scanning,
  connecting,
  provisioning,
  provisioned,
  waiting_dcd,
  waiting_appkey_ack,
  waiting_bind_ack,
  waiting_pub_ack,
  waiting_sub_ack
} state;

enum {
	ADD_DEVICE = 0,
	UPDATE =1
}operation;

enum {
	ON_OFF=1,
	LOCK_UNLOCK,
	TEMPERATURE
} attributeName;

enum{
	Lights=1,
	Switch,
	Lock
} device;

enum {
	operationLength =1,
	deviceNameLength = 10,
	attributeNameLength=20,
	attributeValueLength =10
}packetBlockLength;
struct mesh_generic_state current, target;

uint8_t netkey_id = 0xff;
uint8_t appkey_id = 0xff;
uint8_t ask_user_input = false;
uint16 provisionee_address = 0xFFFF;

uint8_t config_retrycount = 0;
uint8_t _uuid_copy[16];

#ifdef PROVISION_OVER_GATT
bd_addr             bt_address;
uint8               bt_address_type;
#endif

#ifdef USE_FIXED_KEYS
const uint8 fixed_netkey[16] = {0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03};
const uint8 fixed_appkey[16] = {0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03,0x03};;
#endif

typedef struct
{
  uint16 err;
  const char *pShortDescription;
} tsErrCode;

#define STATUS_OK                      0
#define STATUS_BUSY                    0x181

typedef struct
{
  uint16 model_id;
  uint16 vendor_id;
} tsModel;

typedef struct
{
  uint16 loc;
  uint8 numS;
  uint8 numV;

  // reserve space for up to 11 SIG models for each element
  uint16 SIG_models[11];

  // reserve space for up to 4 vendor models for each element
  tsModel vendor_models[4];
} tsElement;

typedef struct
{
  uint16 cid;
  uint16 pid;
  uint16 vid;
  uint16 crpl;
  uint16 features;
  uint8  numElement;  // Not included in the DCD event after v1.4.0 sdk, need to calculate it.
  // reserve space for up to 2 elements
  tsElement element[2];
}tsDCD;

// DCD of the last provisioned device:
tsDCD _sDCD;

typedef struct
{
  uint16 model_id;
  uint16 vendor_id;
  uint8 element_idx;
} provModel;

typedef struct
{
  // model bindings to be done. for simplicity, all models are bound to same appkey in this example
  // (assuming there is exactly one appkey used and the same appkey is used for all model bindings)
  provModel bind_model[4];
  uint8 num_bind;
  uint8 num_bind_done;

  // publish addresses for up to 4 models
  provModel pub_model[4];
  uint16 pub_address[4];
  uint8 num_pub;
  uint8 num_pub_done;

  // subscription addresses for up to 4 models
  provModel sub_model[4];
  uint16 sub_address[4];
  uint8 num_sub;
  uint8 num_sub_done;
}tsConfig;

// config data to be sent to last provisioned node:
tsConfig _sConfig;

#define LIGHT_CTRL_GRP_ADDR     0xC001
#define LIGHT_STATUS_GRP_ADDR   0xC002

