sheldon123z/EFR32-embedded-provisioner/app.c
#define LIGHT_CTL_CTRL_TEMPERATURE   0xC005
#define LIGHT_CTL_STATUS_TEMPERATURE   0xC006

#define VENDOR_GRP_ADDR         0xC003

#define SENSOR_GRP_ADDR			0xC004

/* models used by simple light example (on/off only)
 * The beta SDK 1.0.1 and 1.1.0 examples are based on these
 * */
#define LIGHT_MODEL_ID            0x1000 // Generic On/Off Server
#define SWITCH_MODEL_ID           0x1001 // Generic On/Off Client

/*
 * Lightness models used in the dimming light example of 1.2.0 SDK
 * */
#define DIM_LIGHT_MODEL_ID              0x1300 // Light Lightness Server
#define DIM_SWITCH_MODEL_ID             0x1302 // Light Lightness Client

#define LIGHT_CTL_TEMPERATURE_SERVER    0x1306

#define SENSOR_CLIENT_MODEL_ID            0x1102
#define SENSOR_SERVER_MODEL_ID            0x1100


/*
 * Look-up table for mapping error codes to strings. Not a complete
 * list, for full description of error codes, see
 * Bluetooth LE and Mesh Software API Reference Manual */

tsErrCode _sErrCodes[] = {
    {0x0c01, "already_exists"},
    {0x0c02, "does_not_exist"},
    {0x0c03, "limit_reached"},
    {0x0c04, "invalid_address"},
    {0x0c05, "malformed_data"},
};

const char err_unknown[] = "<?>";

#include "cJSON.h"

/* Include files for usart*/

#include "em_usart.h"


#define INITIAL_COMMAND 0x03
#define EXTERNAL_SIGNAL_LIGHT_ON	0x01
#define EXTERNAL_SIGNAL_LIGHT_OFF	0x02
#define EXTERNAL_SIGNAL_SWITCH_ON	0x03
#define EXTERNAL_SIGNAL_SWITCH_OFF	0x04
/*variable for usart*/
#define BUFFER_SIZE 100
uint32_t rx_data_ready = 0;
char rx_buffer[BUFFER_SIZE];
char tx_buffer[BUFFER_SIZE];
uint8_t Light_state =INITIAL_COMMAND;
/***************************************************************************//**
 * Button initialization. Configure pushbuttons PB0, PB1 as inputs.
 ******************************************************************************/

/***************************************************************************//**
 * RX interrupt handler
 ******************************************************************************/
void USART1_RX_IRQHandler(void)
{
  static uint32_t i = 0;
  uint32_t flags;
  flags = USART_IntGet(USART1);
  USART_IntClear(USART1, flags);

  rx_buffer[i++] = USART_Rx(USART1);


  if (rx_buffer[i - 1] == '\r' || rx_buffer[i - 1] == '\n')
  {
    rx_data_ready = 1;
    rx_buffer[i - 1] = '\0'; // Overwrite CR or LF character
    i = 0;
    printf("buffer is %s\n",rx_buffer);
  }
  if (rx_buffer[i - 1] == '\r' || rx_buffer[i - 1] == '\n')
  {
    rx_data_ready = 1;
    rx_buffer[i - 1] = '\0'; // Overwrite CR or LF character
    i = 0;
    printf("buffer is %s\n",rx_buffer);
  }

  if ( i >= BUFFER_SIZE - 2 )
  {
    rx_data_ready = 1;
    rx_buffer[i] = '\0'; // Do not overwrite last character
    i = 0;
  }
}

/**************************************************************************//**
 * @brief USART1 TX interrupt service routine
 *****************************************************************************/
void USART1_TX_IRQHandler(void)
{
  static uint32_t i = 0;
  uint32_t flags;
  flags = USART_IntGet(USART1);
  USART_IntClear(USART1, flags);

	if (flags & USART_IF_TXC)
	{
		if (i < BUFFER_SIZE && tx_buffer[i] != '\0')
		{
			USART_Tx(USART1, tx_buffer[i]); // Transmit 1 byte each time
			i++;
		}
		else
		{
			i = 0;
		}
	}

}
/***************************************************************************//**
 * Main function.
 ******************************************************************************/
void send_tx_value()
{
//	uint32_t i;
//	if (rx_data_ready)
//		{
//		  USART_IntDisable(USART1, USART_IEN_RXDATAV);
//		  USART_IntDisable(USART1, USART_IEN_TXC);
//
//		  for (i = 0; rx_buffer[i] != '\0' && i < BUFFER_SIZE-3; i++)
//		  {
//			tx_buffer[i] = rx_buffer[i];
//		  }
//
//		  tx_buffer[i] = '\0';
//		  tx_buffer[i++] = '\n';
//		  rx_data_ready = 0;
//
//		  USART_IntEnable(USART1, USART_IEN_RXDATAV);
//		  USART_IntEnable(USART1, USART_IEN_TXC);
//		  USART_IntSet(USART1, USART_IFS_TXC);
//		}
}
//the length of the packet is 36, the length of values shouldn't be greater than segment length
//using 'x' to make up each blank position in each block
//maximum length for attribute value is 4('x' as the end mark take 1 byte )

void sendPacket (char *packet)
{
	uint32_t i;

	for (i = 0; i < strlen(packet); i++)
	{
		USART_Tx(USART1, packet[i]);
	}
	printf("packet:%s has been sent\n", packet);
	return;
}


#define ON_OFF_COMMAND_PACKET "%d%.*s%.*s%.*s"
#define ADJUST_VALUE_COMMAND_PACKET "%d%.*s%.*s%dx"
#define PACKET_LENGTH 100

static char* createControlCommandPacket(int deviceType,const char* deviceName,
								  int attributeType,const char* attributeName,const char* attributeValue)
{

	static char packet[PACKET_LENGTH];
	//blocks in the packet, it differs to the data input because we have to add end mart 'x'
	char device[deviceNameLength]={'\0'};
	char attribute[attributeNameLength]={'\0'};
	char attriValue[10] ={'\0'};

	strcpy(device,deviceName);
	for(int i = strlen(deviceName); i < deviceNameLength;i++)
	{
		device[i]='x';
	}
	strcpy(attribute,attributeName);
	for(int i = strlen(attributeName); i<attributeNameLength; i++)
	{
		attribute[i]='x';
	}
	strcpy(attriValue,attributeValue);
//	printf("attriValue is %s\n, attributeValue is %s\n, attributeValue length is %d\n",attriValue, attributeValue,strlen(attributeValue));

	for(int i = strlen(attributeValue); i < attributeValueLength; i++)
	{

		attriValue[i]='x';

	}
//	printf("attributeValue is :%s\n", attriValue);
	//constructing the packet
	if(deviceType == Lights && attributeType == ON_OFF)
	{
		sprintf(packet,
				ON_OFF_COMMAND_PACKET,
				UPDATE,//1
				deviceNameLength,
				(const char*)device, //10 words
				attributeNameLength,
				(const char*)attribute,//20
				attributeValueLength,
				(const char*)attriValue);//5
		printf("generated packet is:%s\n",packet);
	}
	if(deviceType == Lights && attributeType == LOCK_UNLOCK)
	{
		sprintf(packet,
				ON_OFF_COMMAND_PACKET,
				UPDATE,//1
				deviceNameLength,
				(const char*)device, //10 words
				attributeNameLength,
				(const char*)attribute,//20
				attributeValueLength,
				(const char*)attriValue);//5
	}
	/*if the value for the attribute is not string, for example Temperature, using this one
	 * to generate packet*/
	if(deviceType == Lights && attributeType == TEMPERATURE)
	{
		sprintf(packet,
				ADJUST_VALUE_COMMAND_PACKET,
				UPDATE,//1
				deviceNameLength,
				(const char*)device, //10 words
				attributeNameLength,
				(const char*)attribute,//20
				attributeValueLength,
				atoi((const char*)attributeValue));
	}
	//add other control command generating codes
	packet[PACKET_LENGTH]='\0';
	return packet;

