sheldon123z/EFR32-embedded-provisioner/app.c
}

#define ADD_DEVICE_COMMAND_PACKET "%d%.*s%.*s%.*s" //length should be 1|10|15
//add device command format
//----1----|----10----|----20----|----10-----|
//operation|deviceName|attribute |attriValue|

static char* createUpdateCommandPacket(const char* deviceName, const char* attributeName, const char* defaultAttributeValue)
{
	static char packet[PACKET_LENGTH]={'\0'};
	char device[deviceNameLength]={'\0'};
	char attribute[attributeNameLength]={'\0'};
	char defaultValue[attributeValueLength] ={'\0'};


	strcpy(device,deviceName);
	for(int i = strlen(deviceName); i<deviceNameLength;i++)
	{
		device[i]='x';
	}
	strcpy(attribute,attributeName);
	for(int i = strlen(attributeName); i<attributeNameLength; i++)
	{
		attribute[i]='x';
	}
	strcpy(defaultValue,defaultAttributeValue);
	for(int i = strlen(defaultAttributeValue); i<attributeValueLength;i++)
	{
		defaultValue[i]='x';
	}

	sprintf(packet,
			ADD_DEVICE_COMMAND_PACKET,
			ADD_DEVICE,
			deviceNameLength,
			device,
			attributeNameLength,
			attribute,
			attributeValueLength,
			defaultValue);

	return packet;

}

void parse_message(char *message)
{
	printf("received message is: %s\n",message);
	const char ON[]="\"ON\"";
	const char OFF[]="\"OFF\"";
	if(strcmp(message,ON)==0)
	{
		Light_state = MESH_GENERIC_ON_OFF_STATE_ON;
	}
	else if(strcmp(message,OFF)==0)
	{
		Light_state = MESH_GENERIC_ON_OFF_STATE_OFF;

	}
	else
	{
		printf("parse error: The command is neither on nor off\n");
	}

}



void generate_external_signal()
{
	if(rx_data_ready && Light_state != INITIAL_COMMAND)
	{
		if(Light_state == MESH_GENERIC_ON_OFF_STATE_ON)
		{
			//produce an external signal
			gecko_external_signal(EXTERNAL_SIGNAL_LIGHT_ON);

		}
		else if(Light_state == MESH_GENERIC_ON_OFF_STATE_OFF )
		{
			//produce an external signal
			gecko_external_signal(EXTERNAL_SIGNAL_LIGHT_OFF);
		}
		else
		{
			printf("generate external signal error: check Light_state\n");
			printf("the Light_state is %d\n", Light_state);
		}
		rx_data_ready = 0;
		//clear buffer
		memset(rx_buffer,0,BUFFER_SIZE*sizeof(char));
	}
}
void setCallBack()
{
	if(rx_data_ready)
	 {
		parse_message(rx_buffer);
		generate_external_signal();
	 }
}

const char * res2str(uint16 err)
{
  int i;

  for(i=0;i<sizeof(_sErrCodes)/sizeof(tsErrCode);i++)
  {
    if(err == _sErrCodes[i].err)
    {
      return _sErrCodes[i].pShortDescription;
    }
  }

  // code was not found in the lookup table
  return err_unknown;
}


/***************************************************************************//**
 * This function is called to initiate factory reset. Factory reset may be
 * initiated by keeping one of the WSTK pushbuttons pressed during reboot.
 * Factory reset is also performed if it is requested by the provisioner
 * (event gecko_evt_mesh_node_reset_id).
 ******************************************************************************/
static void initiate_factory_reset(void)
{
  printf("factory reset\r\n");
//  DI_Print("\n***\nFACTORY RESET\n***", DI_ROW_STATUS);

  /* if connection is open then close it before rebooting */
  if (conn_handle != 0xFF) {
    gecko_cmd_le_connection_close(conn_handle);
  }

  /* perform a factory reset by erasing PS storage. This removes all the keys and other settings
     that have been configured for this node */
  gecko_cmd_flash_ps_erase_all();
  // reboot after a small delay
  gecko_cmd_hardware_set_soft_timer(2 * 32768, TIMER_ID_SYS_FACTORY_RESET, 1);
}


/***************************************************************************//**
 * This function prints debug information for mesh server state change event.
 *
 * @param[in] pEvt  Pointer to mesh_lib_generic_server_state_changed event.
 ******************************************************************************/
static void server_state_changed(struct gecko_msg_mesh_generic_server_state_changed_evt_t *pEvt)
{
  int i;

  printf("state changed: ");
  printf("model ID %4.4x, type %2.2x ", pEvt->model_id, pEvt->type);
  for (i = 0; i < pEvt->parameters.len; i++) {
    printf("%2.2x ", pEvt->parameters.data[i]);
  }
  printf("\r\n");
}

/*******************************************************************************
 * Initialise used bgapi classes.
 ******************************************************************************/
void gecko_bgapi_classes_init(void)
{
  gecko_bgapi_class_dfu_init();
  gecko_bgapi_class_system_init();
  gecko_bgapi_class_le_gap_init();
  gecko_bgapi_class_le_connection_init();
  gecko_bgapi_class_gatt_init();
  gecko_bgapi_class_gatt_server_init();
  gecko_bgapi_class_hardware_init();
  gecko_bgapi_class_flash_init();
  gecko_bgapi_class_test_init();
  //gecko_bgapi_class_sm_init();
  //mesh_native_bgapi_init();
//  gecko_bgapi_class_mesh_node_init();   //
#ifdef REMOTE_ONOFF_CTL_FROM_PROV
  gecko_bgapi_class_mesh_generic_server_init();   // If need to sub the message from group, need to initialize BGAPI class mesh_generic_server
  gecko_bgapi_class_mesh_generic_client_init();   // If need to pub the message to group, need to initialize BGAPI class mesh_generic_client
  gecko_bgapi_class_mesh_test_init();       // If need the provisioner to pub/sub to/from group, initialize BGAPI class mesh_test
#endif
  gecko_bgapi_class_mesh_prov_init();
  gecko_bgapi_class_mesh_config_client_init();

//  gecko_bgapi_class_mesh_proxy_init();
//  gecko_bgapi_class_mesh_proxy_server_init();
  //gecko_bgapi_class_mesh_proxy_client_init();

  //gecko_bgapi_class_mesh_vendor_model_init();
  //gecko_bgapi_class_mesh_health_client_init();
  //gecko_bgapi_class_mesh_health_server_init();
  //gecko_bgapi_class_mesh_test_init();
  //gecko_bgapi_class_mesh_lpn_init();
//  gecko_bgapi_class_mesh_friend_init();
}

/*
 * Add one publication setting to the list of configurations to be done
 * */
static void config_pub_add(uint16 model_id, uint16 vendor_id, uint8_t element_idx, uint16 address)
{
  _sConfig.pub_model[_sConfig.num_pub].model_id = model_id;
  _sConfig.pub_model[_sConfig.num_pub].vendor_id = vendor_id;
  _sConfig.pub_model[_sConfig.num_pub].element_idx = element_idx;
  _sConfig.pub_address[_sConfig.num_pub] = address;
  _sConfig.num_pub++;
}

