sheldon123z/EFR32-embedded-provisioner/app.c
/*
 * Add one subscription setting to the list of configurations to be done
 * */
static void config_sub_add(uint16 model_id, uint16 vendor_id, uint8_t element_idx, uint16 address)
{
  _sConfig.sub_model[_sConfig.num_sub].model_id = model_id;
  _sConfig.sub_model[_sConfig.num_sub].vendor_id = vendor_id;
  _sConfig.sub_model[_sConfig.num_sub].element_idx = element_idx;
  _sConfig.sub_address[_sConfig.num_sub] = address;
  _sConfig.num_sub++;
}

/*
 * Add one appkey/model bind setting to the list of configurations to be done
 * */
static void config_bind_add(uint16 model_id, uint16 vendor_id, uint8_t element_idx, uint16 netkey_id, uint16 appkey_id)
{
  _sConfig.bind_model[_sConfig.num_bind].model_id = model_id;
  _sConfig.bind_model[_sConfig.num_bind].vendor_id = vendor_id;
  _sConfig.bind_model[_sConfig.num_bind].element_idx = element_idx;
  _sConfig.num_bind++;
}

/*
 * This function scans for the SIG models in the DCD that was read from a freshly provisioned node.
 * Based on the models that are listed, the publish/subscribe addresses are added into a configuration list
 * that is later used to configure the node.
 *
 * This example configures generic on/off client and lightness client to publish
 * to "light control" group address and subscribe to "light status" group address.
 *
 * Similarly, generic on/off server and lightness server (= the light node) models
 * are configured to subscribe to "light control" and publish to "light status" group address.
 *
 * Alternative strategy for automatically filling the configuration data would be to e.g. use the product ID from the DCD.
 *
 *
 * */


static void config_check()
{
  uint8 i,elementIdx;

  memset(&_sConfig, 0, sizeof(_sConfig));

  printf("\n------------ add models to sub/pub/bind list ------------\r\n");

  for(elementIdx=0; elementIdx<_sDCD.numElement;elementIdx++)
  {

    for(i=0; i<_sDCD.element[elementIdx].numS;i++)
      printf("SIG model ID: 0x%04x\r\n", _sDCD.element[elementIdx].SIG_models[i]);

    for(i=0; i<_sDCD.element[elementIdx].numV;i++)
      printf("Vendor model ID: vendorID 0x%04x modelID 0x%04x\r\n",
          _sDCD.element[elementIdx].vendor_models[i].vendor_id,
          _sDCD.element[elementIdx].vendor_models[i].model_id);

    printf("\r\n");

    // scan the SIG models in the DCD data
    for(i=0;i<_sDCD.element[elementIdx].numS;i++)
    {
      if(_sDCD.element[elementIdx].SIG_models[i] == SWITCH_MODEL_ID)
      {
        config_pub_add(SWITCH_MODEL_ID, 0xFFFF, elementIdx, LIGHT_CTRL_GRP_ADDR);
        config_sub_add(SWITCH_MODEL_ID, 0xFFFF, elementIdx, LIGHT_STATUS_GRP_ADDR);
        config_bind_add(SWITCH_MODEL_ID, 0xFFFF, elementIdx, 0, 0);
        printf("add the Generic On/Off Client model to sub/pub/bind list, elementIdx = %d\r\n",elementIdx);
      }
      else if(_sDCD.element[elementIdx].SIG_models[i] == LIGHT_MODEL_ID)
      {
        config_pub_add(LIGHT_MODEL_ID, 0xFFFF, elementIdx, LIGHT_STATUS_GRP_ADDR);
        config_sub_add(LIGHT_MODEL_ID, 0xFFFF, elementIdx, LIGHT_CTRL_GRP_ADDR);
        config_bind_add(LIGHT_MODEL_ID, 0xFFFF, elementIdx, 0, 0);
        printf("add the Generic On/Off Server model to sub/pub/bind list, elementIdx = %d\r\n",elementIdx);
      }
    // Just consider the Generic On/Off model for test
//      else if(_sDCD.element[elementIdx].SIG_models[i] == DIM_SWITCH_MODEL_ID)
//      {
//        config_pub_add(DIM_SWITCH_MODEL_ID, 0xFFFF, LIGHT_CTRL_GRP_ADDR);
//        config_sub_add(DIM_SWITCH_MODEL_ID, 0xFFFF, LIGHT_STATUS_GRP_ADDR);
//        config_bind_add(DIM_SWITCH_MODEL_ID, 0xFFFF, 0, 0);
//        printf("add the Light Lightness Client model to sub/pub/bind list\r\n");
//      }
//      else if(_sDCD.element[elementIdx].SIG_models[i] == DIM_LIGHT_MODEL_ID)
//      {
//        config_pub_add(DIM_LIGHT_MODEL_ID, 0xFFFF, LIGHT_STATUS_GRP_ADDR);
//        config_sub_add(DIM_LIGHT_MODEL_ID, 0xFFFF, LIGHT_CTRL_GRP_ADDR);
//        config_bind_add(DIM_LIGHT_MODEL_ID, 0xFFFF, 0, 0);
//        printf("add the Light Lightness Server model to sub/pub/bind list\r\n");
//      }
//      else if(_sDCD.element[elementIdx].SIG_models[i] == LIGHT_CTL_TEMPERATURE_SERVER)
//      {
//        config_pub_add(LIGHT_CTL_TEMPERATURE_SERVER, 0xFFFF, elementIdx, LIGHT_CTL_STATUS_TEMPERATURE);
//        config_sub_add(LIGHT_CTL_TEMPERATURE_SERVER, 0xFFFF, elementIdx, LIGHT_CTL_CTRL_TEMPERATURE);
//        config_bind_add(LIGHT_CTL_TEMPERATURE_SERVER, 0xFFFF, elementIdx, 0, 0);
//        printf("add the CTL temperature Server model to sub/pub/bind list, elementIdx = %d\r\n", elementIdx);
//      }
		else if(_sDCD.element[elementIdx].SIG_models[i] == SENSOR_CLIENT_MODEL_ID)
		{
			config_pub_add(SENSOR_CLIENT_MODEL_ID, 0xFFFF, elementIdx, SENSOR_GRP_ADDR);
			config_sub_add(SENSOR_CLIENT_MODEL_ID, 0xFFFF, elementIdx, SENSOR_GRP_ADDR);
			config_bind_add(SENSOR_CLIENT_MODEL_ID, 0xFFFF, elementIdx, 0, 0);
			printf("add the sensor client model to sub/pub/bind list, elementIdx = %d\r\n",elementIdx);
		}
		else if(_sDCD.element[elementIdx].SIG_models[i] == SENSOR_SERVER_MODEL_ID)
		{
			config_pub_add(SENSOR_SERVER_MODEL_ID, 0xFFFF, elementIdx, SENSOR_GRP_ADDR);
			config_sub_add(SENSOR_SERVER_MODEL_ID, 0xFFFF, elementIdx, SENSOR_GRP_ADDR);
			config_bind_add(SENSOR_SERVER_MODEL_ID, 0xFFFF, elementIdx, 0, 0);
			printf("add the sensor server model to sub/pub/bind list, elementIdx = %d\r\n",elementIdx);
		}

    }

  #ifdef CONFIGURE_VENDOR_MODEL
    printf("---------- add Vendor models to sub/pub/bind list ----------\r\n");
    // scan the vendor models found in the DCD
    for(i=0;i<_sDCD.element[elementIdx].numV;i++)
    {
      // this example only handles vendor model with vendor ID 0x02FF (Silabs) and model ID 0xABCD.
      // if such model found, configure it to publish/subscribe to a single group address
      if((_sDCD.element[elementIdx].vendor_models[i].model_id == 0xABCD) && (_sDCD.element[elementIdx].vendor_models[i].vendor_id == 0x02FF))
      {
        config_pub_add(0xABCD, 0x02FF, elementIdx, VENDOR_GRP_ADDR);
        config_sub_add(0xABCD, 0x02FF, elementIdx, VENDOR_GRP_ADDR);
        // using single appkey to bind all models. It could be also possible to use different appkey for the
        // vendor models
        config_bind_add(0xABCD, 0x02FF, elementIdx, 0, 0);
      }
    }
  #endif
  }
}


static void  button_poll()
{

  if(ask_user_input == false){
    return;
  }

