sheldon123z/EFR32-embedded-provisioner/app.c
  if (GPIO_PinInGet(BSP_BUTTON1_PORT, BSP_BUTTON1_PIN) == 0) {
    ask_user_input = false;
    printf("Sending prov request\r\n");

#ifndef PROVISION_OVER_GATT
    // provisioning using ADV bearer (this is the default)
    struct gecko_msg_mesh_prov_provision_device_rsp_t *prov_resp_adv;
    prov_resp_adv = gecko_cmd_mesh_prov_provision_device(netkey_id, 16, _uuid_copy);

    if (prov_resp_adv->result == 0) {
      printf("Successful call of gecko_cmd_mesh_prov_provision_device\r\n");
      state = provisioning;
    } else {
      printf("Failed call to provision node. %x\r\n", prov_resp_adv->result);
    }
#else
    // provisioning using GATT bearer. First we must open a connection to the remote device
    if(gecko_cmd_le_gap_open(bt_address, bt_address_type)->result == 0)
    {
      printf("trying to open a connection\r\n");
    }
    else
    {
      printf("le_gap_open failed\r\n");
    }
    state = connecting;

#endif
  }
  else if (GPIO_PinInGet(BSP_BUTTON0_PORT, BSP_BUTTON0_PIN) == 0) {
    ask_user_input = false;
  }

}


static void DCD_decode(struct gecko_msg_mesh_config_client_dcd_data_evt_t *pDCD)
{
  uint16 *pu16;
  uint8 i,j;

  if(pDCD->page)
    return;

  printf("--------------------- Decode the DCD ---------------------- \r\n");

  // Clear the _sDCD structure for each node DCD decode
  memset(&_sDCD, 0, sizeof(_sDCD));

  pu16 = (uint16 *)&(pDCD->data.data[0]);

  _sDCD.cid = *pu16++;
  _sDCD.pid = *pu16++;
  _sDCD.vid = *pu16++;
  _sDCD.crpl = *pu16++;
  _sDCD.features = *pu16++;

  printf("DCD: company ID 0x%4.4x, Product ID 0x%4.4x, Vendor ID 0x%4.4x, CRPL 0x%4.4x, features 0x%4.4x\r\n",
      _sDCD.cid,
      _sDCD.pid,
      _sDCD.vid,
      _sDCD.crpl,
      _sDCD.features);

  // calculate the number of elements
  // CID, PID, VID, CRPL, Features total 10 octets, grab elements from 11 octets
  for(i = 10; i < pDCD->data.len;)
  {
    i = i + ((4 + pDCD->data.data[i+2]*2 + pDCD->data.data[i+3]*4));
    _sDCD.numElement++;
  }

  printf("DCD: elements number %d \r\n", _sDCD.numElement);

  for(i = 0; i<_sDCD.numElement; i++)
  {
    _sDCD.element[i].loc = *pu16++;

    _sDCD.element[i].numS = (uint8)(*pu16 & 0x00FF);
    _sDCD.element[i].numV = (uint8)((*pu16 & 0xFF00) >> 8);
    pu16++;

    printf(" ->->-> element %d information ->->-> \r\n",i);
    // grab the SIG models from the DCD data
    for(j=0; j<_sDCD.element[i].numS; j++)
    {
      _sDCD.element[i].SIG_models[j] = *pu16++;
      printf("SIG model ID: 0x%04X\r\n", _sDCD.element[i].SIG_models[j]);
    }

    // grab the vendor models from the DCD data
    for(j=0; j<_sDCD.element[i].numV; j++)
    {
      _sDCD.element[i].vendor_models[j].vendor_id = *pu16++;
      _sDCD.element[i].vendor_models[j].model_id = *pu16++;
      printf("Vendor model ID: 0x%04X, model ID: 0x%04X\r\n", _sDCD.element[i].vendor_models[j].vendor_id, _sDCD.element[i].vendor_models[j].model_id);
    }

  }
//
//
//  _sDCD.element[0].loc = *pu16++;
//
//  _sDCD.element[0].numS = (uint8)(*pu16 & 0x00FF);
//  _sDCD.element[0].numV = (uint8)((*pu16 & 0xFF00) >> 8);
//  pu16++;
//
//  // grab the SIG models from the DCD data
//  for(i=0; i<_sDCD.element[0].numS; i++)
//  {
//    _sDCD.element[0].SIG_models[i] = *pu16++;
//    printf("SIG model ID: %4.4x\r\n", _sDCD.element[0].SIG_models[i]);
//  }
//
//  // grab the vendor models from the DCD data
//  for(i=0; i<_sDCD.element[0].numV; i++)
//  {
//    _sDCD.element[0].vendor_models.vendor_id = *pu16++;
//    _sDCD.element[0].vendor_models.model_id = *pu16++;
//    printf("vendor ID: %4.4x, model ID: %4.4x\r\n", _sDCD.element[0].vendor_models.vendor_id, _sDCD.element[0].vendor_models.model_id);
//  }
//
//
//  _sDCD.element[0].loc = *pu16++;
//
//
//  _sDCD.numElem = pDCD->elements;
//  _sDCD.numModels = pDCD->models;
//
//  pu8 = &(pDCD->element_data.data[2]);
//
//  _sDCD.numSIGModels = *pu8;
//
//  printf("Num sig models: %d\r\n", _sDCD.numSIGModels );
//
//  pu16 = (uint16 *)&(pDCD->element_data.data[4]);
//
//  modelsCap = sizeof(_sDCD.SIG_models)/sizeof(_sDCD.SIG_models[0]);
//  modelsCap = (_sDCD.numSIGModels < modelsCap)?_sDCD.numSIGModels:modelsCap;
//  // number of SIG models stored in the _sDCD structure
//  _sDCD.numSIGModels = modelsCap;
//
//  // grab the SIG models from the DCD data
//  for(i=0;i<_sDCD.numSIGModels;i++)
//  {
//    _sDCD.SIG_models[i] = *pu16;
//    pu16++;
//    printf("model ID: %4.4x\r\n", _sDCD.SIG_models[i]);
//  }
//
//  pu8 = &(pDCD->element_data.data[3]);
//
//  _sDCD.numVendorModels = *pu8;
//
//  printf("Num vendor models: %d\r\n", _sDCD.numVendorModels);
//
//  pu16 = (uint16_t *) &(pDCD->element_data.data[4 + 2 * _sDCD.numSIGModels]);
//
//  modelsCap = sizeof(_sDCD.vendor_models)/sizeof(_sDCD.vendor_models[0]);
//  modelsCap = (_sDCD.numVendorModels < modelsCap)?_sDCD.numVendorModels:modelsCap;
//  // number of Vendor models stored in the _sDCD structure
//  _sDCD.numVendorModels = modelsCap;
//
//  // grab the vendor models from the DCD data
//  for (i = 0; i < _sDCD.numVendorModels; i++) {
//    _sDCD.vendor_models[i].vendor_id = *pu16;
//    pu16++;
//    _sDCD.vendor_models[i].model_id = *pu16;
//    pu16++;
//
//    printf("vendor ID: %4.4x, model ID: %4.4x\r\n", _sDCD.vendor_models[i].vendor_id, _sDCD.vendor_models[i].model_id);
//  }

}


//static void config_retry()
//{
//
//  uint8 timer_handle = 0;
//
//  switch(state)
//  {
//  case waiting_appkey_ack:
//    timer_handle = TIMER_ID_APPKEY_ADD;
//    break;
//
//  case waiting_bind_ack:
//    timer_handle = TIMER_ID_APPKEY_BIND;
//    break;
//
//  case waiting_pub_ack:
//    timer_handle = TIMER_ID_PUB_SET;
//    break;
//
//  case waiting_sub_ack:
//    timer_handle = TIMER_ID_SUB_ADD;
//    break;
//
//  default:
//    printf("config_retry(): don't know how to handle state %d\r\n", state);
//    break;
//  }
//
//  if(timer_handle > 0)
//  {
//    printf("config retry: try step %d again\r\n", state);
//    gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), timer_handle, 1);
//  }
//
//}

#ifdef REMOTE_ONOFF_CTL_FROM_PROV
void send_onoff_request(int retrans)
{
  static uint8_t onOffCtl = 0;
  static uint8_t trid = 0;
  uint16 resp;
  uint16 delay = 0;
  struct mesh_generic_request req;
  const uint32 transtime = 0; /* using zero transition time by default */

