sheldon123z/EFR32-embedded-provisioner/app.c
  req.kind = mesh_generic_request_on_off;
  req.on_off = onOffCtl ? MESH_GENERIC_ON_OFF_STATE_ON : MESH_GENERIC_ON_OFF_STATE_OFF;
  onOffCtl = onOffCtl?0:1;

  // increment transaction ID for each request, unless it's a retransmission
  if (retrans == 0) {
    trid++;
  }

  /* delay for the request is calculated so that the last request will have a zero delay and each
   * of the previous request have delay that increases in 50 ms steps. For example, when using three
   * on/off requests per button press the delays are set as 100, 50, 0 ms
   */
  resp = gecko_cmd_mesh_generic_client_publish(
    MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID,
    0,
    trid,
    transtime,   // transition time in ms
    delay,
    0,     // flags
    mesh_generic_request_on_off,     // type
    1,     // param len
    &req.on_off     /// parameters data
    )->result;


//  gecko_cmd_generic_client_set();

  if (resp) {
    printf("gecko_cmd_mesh_generic_client_publish failed,code %x\r\n", resp);
  } else {
    printf("request sent, delay = %d\r\n", delay);
  }

}
#endif


/**
 * sending on_off directives to node, the original message from UART
 */
static void send_onoff_directives(int retrans, uint8_t on_off)
{
  static uint8_t onOffCtl = 0;
  static uint8_t trid = 0;
  uint16 resp;
  uint16 delay = 0;
  struct mesh_generic_request req;
  const uint32 transtime = 0; /* using zero transition time by default */

  req.kind = mesh_generic_request_on_off;
  req.on_off = on_off;
  onOffCtl = onOffCtl?0:1;

  // increment transaction ID for each request, unless it's a retransmission
  if (retrans == 0) {
    trid++;
  }

  /* delay for the request is calculated so that the last request will have a zero delay and each
   * of the previous request have delay that increases in 50 ms steps. For example, when using three
   * on/off requests per button press the delays are set as 100, 50, 0 ms
   */
  resp = gecko_cmd_mesh_generic_client_publish(
    MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID,
    0,
    trid,
    transtime,   // transition time in ms
    delay,
    0,     // flags
    mesh_generic_request_on_off,     // type
    1,     // param len
    &req.on_off     /// parameters data
    )->result;

//  gecko_cmd_generic_client_set();

  if (resp) {
    printf("gecko_cmd_mesh_generic_client_publish failed,code %x\r\n", resp);
  } else {
    printf("request sent, delay = %d\r\n", delay);
  }

}

/**
 * handler to handle different commands for sending on off directives to node
 * invoked by the event geck_evt_external_signal_id
 *
 */
static void handle_turn_onoff_event(uint8_t command)
{
	printf("Sending on_off directive\r\n");
	send_onoff_directives(0,command);
	/* start a repeating soft timer to trigger re-transmission of the request after 50 ms delay */
	//gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(50), ONOFF_TIMER_ID_RETRANS, 0);
}


static void handle_turn_switch_onoff_command(uint8_t command)
{
	printf("Sending on_off directive\r\n");
	}

/*******************************************************************************
 * Handling of stack events. Both Bluetooth LE and Bluetooth mesh events
 * are handled here.
 * @param[in] evt_id  Incoming event ID.
 * @param[in] evt     Pointer to incoming event.
 ******************************************************************************/
void handle_gecko_event(uint32_t evt_id, struct gecko_cmd_packet *evt)
{
  if (NULL == evt) {
    return;
  }

  switch (evt_id) {
    case gecko_evt_system_boot_id:
      // check pushbutton state at startup. If either PB0 or PB1 is held down then do factory reset
      if ((GPIO_PinInGet(BSP_BUTTON0_PORT, BSP_BUTTON0_PIN) == 0) || (GPIO_PinInGet(BSP_BUTTON1_PORT, BSP_BUTTON1_PIN) == 0)) {
        initiate_factory_reset();
      } else {
        printf("Initializing as provisioner\r\n");

        state = init;
        // init as provisioner
        struct gecko_msg_mesh_prov_init_rsp_t *prov_init_rsp = gecko_cmd_mesh_prov_init();
        if (prov_init_rsp->result == 0) {
          printf("Successfully initialized\r\n");
        } else {
          printf("Error initializing node as provisioner. Error %x\r\n", prov_init_rsp->result);
          gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(20), TIMER_ID_SYS_RESTART, 1);
        }
      }
      break;

    case gecko_evt_hardware_soft_timer_id:
      switch (evt->data.evt_hardware_soft_timer.handle) {

//      //retrans once onoff directive
//      	case ONOFF_TIMER_ID_RETRANS:
//      	  send_onoff_directives(1);
//          break;

        case TIMER_ID_SYS_BUTTON_POLL:
          button_poll();
          break;

        case TIMER_ID_GET_DCD:
        {
  //        struct gecko_msg_mesh_prov_get_dcd_rsp_t*  get_dcd_result = gecko_cmd_mesh_prov_get_dcd(provisionee_address, 0xFF);

          struct gecko_msg_mesh_config_client_get_dcd_rsp_t* get_dcd_result = gecko_cmd_mesh_config_client_get_dcd(netkey_id, provisionee_address, 0xFF);

          if (get_dcd_result->result == 0x0181) {
            printf(".");
            fflush(stdout);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(1000), TIMER_ID_GET_DCD, 1);
          } else if(get_dcd_result->result != STATUS_OK){
            printf("gecko_cmd_mesh_config_client_get_dcd failed with result 0x%X (%s) addr %x\r\n", get_dcd_result->result, res2str(get_dcd_result->result), provisionee_address);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(1000), TIMER_ID_GET_DCD, 1);
          }
          else
          {
            printf("requesting DCD from the node...\r\n");
            state = waiting_dcd;
          }

        }
        break;

        case TIMER_ID_APPKEY_ADD:
        {
  //        struct gecko_msg_mesh_prov_appkey_add_rsp_t *appkey_deploy_evt;
  //            appkey_deploy_evt = gecko_cmd_mesh_prov_appkey_add(provisionee_address, netkey_id, appkey_id);

          struct gecko_msg_mesh_config_client_add_appkey_rsp_t *appkey_deploy_evt;
          appkey_deploy_evt = gecko_cmd_mesh_config_client_add_appkey(netkey_id, provisionee_address, appkey_id, netkey_id);

          if (appkey_deploy_evt->result == STATUS_OK) {
            printf("Add an application key to device, address 0x%x, waiting for the response\r\n", provisionee_address);
            state = waiting_appkey_ack;
          }
          else{
            printf("Appkey deployment failed. addr 0x%04x, error: 0x%X\r\n", provisionee_address, appkey_deploy_evt->result);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_ADD, 1);
          }
        }
        break;

