sheldon123z/EFR32-embedded-provisioner/app.c
        case TIMER_ID_APPKEY_BIND:
        {
          uint16 vendor_id;
          uint16 model_id;
          uint8 element_idx = 0;

          // take the next model from the list of models to be bound with application key.
          // for simplicity, the same appkey is used for all models but it is possible to also use several appkeys
          model_id = _sConfig.bind_model[_sConfig.num_bind_done].model_id;
          vendor_id = _sConfig.bind_model[_sConfig.num_bind_done].vendor_id;
          element_idx = _sConfig.bind_model[_sConfig.num_bind_done].element_idx;

          printf("APP_BIND, config %d/%d:: model %4.4x key index %x\r\n", _sConfig.num_bind_done+1, _sConfig.num_bind, model_id, appkey_id);

  //        struct gecko_msg_mesh_prov_model_app_bind_rsp_t *model_app_bind_result = gecko_cmd_mesh_prov_model_app_bind(provisionee_address,
  //            provisionee_address,
  //          netkey_id,
  //          appkey_id,
  //          vendor_id,
  //          model_id);

          struct gecko_msg_mesh_config_client_bind_model_rsp_t *model_app_bind_result = gecko_cmd_mesh_config_client_bind_model(netkey_id,
              provisionee_address,
              element_idx,    // only bind the models for the element 0 by default
              appkey_id,
              vendor_id,
              model_id);

          if (model_app_bind_result->result == STATUS_BUSY)
          {
            printf(".");
            fflush(stdout);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_BIND, 1);
          }
          else if(model_app_bind_result->result != STATUS_OK)
          {
            printf("prov_model_app_bind failed with result 0x%X\r\n", model_app_bind_result->result);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_BIND, 1);
          }
          else if(model_app_bind_result->result  == STATUS_OK)
          {
            printf("Bind an application key successfully, waiting bind ack\r\n");
            state = waiting_bind_ack;
          }
        }
        break;

        case TIMER_ID_PUB_SET:
        {
          uint16 vendor_id;
          uint16 model_id;
          uint16 pub_address;
          uint8 element_idx = 0;

          // get the next model/address pair from the configuration list:
          model_id = _sConfig.pub_model[_sConfig.num_pub_done].model_id;
          vendor_id = _sConfig.pub_model[_sConfig.num_pub_done].vendor_id;
          element_idx = _sConfig.pub_model[_sConfig.num_pub_done].element_idx;
          pub_address = _sConfig.pub_address[_sConfig.num_pub_done];

          printf("publish set, config %d/%d: model %4.4x -> address %4.4x\r\n", _sConfig.num_pub_done+1, _sConfig.num_pub, model_id, pub_address);

  //        struct gecko_msg_mesh_prov_model_pub_set_rsp_t *model_pub_set_result = gecko_cmd_mesh_prov_model_pub_set(provisionee_address,
  //          provisionee_address,
  //          netkey_id,
  //          appkey_id,
  //          vendor_id,
  //          model_id,
  //          pub_address,
  //          3,           /* Publication time-to-live value */
  //          0, /* period = NONE */
  //          0   /* model publication retransmissions */
  //        );

          struct gecko_msg_mesh_config_client_set_model_pub_rsp_t *model_pub_set_result = gecko_cmd_mesh_config_client_set_model_pub(netkey_id,
              provisionee_address,
              element_idx,                // element_index
              vendor_id,
              model_id,
              pub_address,
              appkey_id,
              0,              // friendship credential flag
              3,              // Publication time-to-live value
              0,              // period = NONE
              0,              // model publication retransmissions
              50               // publication retransmissions interval, range 50 to 1600ms
              );

          if (model_pub_set_result->result == STATUS_BUSY)
          {
            printf(".");
            fflush(stdout);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_PUB_SET, 1);
          }
          else if(model_pub_set_result->result != STATUS_OK)
          {
            printf("prov_model_pub_set failed with result 0x%04X\r\n", model_pub_set_result->result);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_PUB_SET, 1);
          }
          else if (model_pub_set_result->result == STATUS_OK)
          {
            printf("Set model publication state success - waiting pub ack\r\n");
            state = waiting_pub_ack;
          }
        }
        break;

        case TIMER_ID_SUB_ADD:
        {
          uint16 vendor_id = 0xFFFF;
          uint16 model_id;
          uint16 sub_address;
          uint8 element_idx = 0;

          // get the next model/address pair from the configuration list:
          model_id = _sConfig.sub_model[_sConfig.num_sub_done].model_id;
          vendor_id = _sConfig.sub_model[_sConfig.num_sub_done].vendor_id;
          element_idx = _sConfig.sub_model[_sConfig.num_sub_done].element_idx;

          sub_address = _sConfig.sub_address[_sConfig.num_sub_done];

          printf("subscription add, config %d/%d: model %4.4x -> address %4.4x\r\n", _sConfig.num_sub_done+1, _sConfig.num_sub, model_id, sub_address);

  //        struct gecko_msg_mesh_prov_model_sub_add_rsp_t *model_sub_add_result = gecko_cmd_mesh_prov_model_sub_add(provisionee_address,
  //            provisionee_address,
  //          netkey_id,
  //          vendor_id,
  //          model_id,
  //          sub_address);

          struct gecko_msg_mesh_config_client_add_model_sub_rsp_t *model_sub_add_result = gecko_cmd_mesh_config_client_add_model_sub(netkey_id,
              provisionee_address,
              element_idx,
              vendor_id,
              model_id,
              sub_address);

          if(model_sub_add_result->result == STATUS_BUSY)
          {
            printf(".");
            fflush(stdout);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_SUB_ADD, 1);
          }
          else if(model_sub_add_result->result != STATUS_OK)
          {
            printf("prov_model_sub_add failed with result 0x%X\r\n",model_sub_add_result->result);
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_SUB_ADD, 1);
          }
          else if (model_sub_add_result->result == STATUS_OK)
          {
            printf("Add address to model subscription list success - waiting sub ack\r\n");
            state = waiting_sub_ack;
          }
        }
        break;

//  #ifdef REMOTE_ONOFF_CTL_FROM_PROV
//        case TIMER_ID_SEND_PUB_MSG:
//          // send the pub message from provisioner
//          printf("evt TIMER_ID_SEND_PUB_MSG send the message from provisioner\r\n");
//          send_onoff_request(0);
//          break;
//  #endif

