sheldon123z/EFR32-embedded-provisioner/app.c
        case TIMER_ID_SYS_FACTORY_RESET:
          gecko_cmd_system_reset(0);
          break;

        case TIMER_ID_SYS_RESTART:
          gecko_cmd_system_reset(0);
          break;

        default:
          break;
        }

      break;

    case gecko_evt_mesh_config_client_dcd_data_id:
    {
      struct gecko_msg_mesh_config_client_dcd_data_evt_t *pDCD = (struct gecko_msg_mesh_config_client_dcd_data_evt_t *)&(evt->data);
      printf("evt: gecko_evt_mesh_config_client_dcd_data_id, request 0x%08lx page 0x%02x\r\n", pDCD->handle, pDCD->page);

      if(pDCD->page == 0)   // page 0 contains the DCD
      {
        // decode the DCD content
        DCD_decode(pDCD);

        // check the desired confiONguration settings depending on what's in the DCD
        config_check();
      }

    }
      break;

    case gecko_evt_mesh_config_client_dcd_data_end_id:
    {
      struct gecko_msg_mesh_config_client_dcd_data_end_evt_t *pDcdEnd = (struct gecko_msg_mesh_config_client_dcd_data_end_evt_t *)&(evt->data);
      printf("evt: gecko_evt_mesh_config_client_dcd_data_end_id, request 0x%08lx result 0x%X\r\n",
          pDcdEnd->handle,
          pDcdEnd->result);

      if(pDcdEnd->result != STATUS_OK)
      {
        // if config failed, try again up to 5 times
        if (config_retrycount++ < 5) {
          printf("Get DCD not successful, will try again\r\n");
          gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_GET_DCD, 1);
        }
        else
        {
          printf("ERROR: get DCD failed, retry limit reached. stuck at state %d\r\n", state);
        }
      }
      else
      {
        config_retrycount = 0;
        // next step : send appkey to device
        gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_ADD, 1);
      }
    }
      break;

    case gecko_evt_mesh_config_client_appkey_status_id:
    {
      struct gecko_msg_mesh_config_client_appkey_status_evt_t *pRsp = (struct gecko_msg_mesh_config_client_appkey_status_evt_t *)&(evt->data);
      if(state == waiting_appkey_ack)
      {
        if(pRsp->result != STATUS_OK)
        {
          printf("evt: gecko_evt_mesh_config_client_appkey_status_id, Add an application key failed, error 0x%04X \r\n", pRsp->result);

          // if config failed, try again up to 5 times
          if (config_retrycount++ < 5) {
            printf("Not successful, will try again\r\n");
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_ADD, 1);
          }
          else
          {
            printf("ERROR: config failed, retry limit reached. stuck at state %d\r\n", state);
          }
        }
        else
        {
          config_retrycount = 0;
          printf("evt: gecko_evt_mesh_config_client_appkey_status_id, Add an application key successfully \r\n");
          gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_BIND, 1);
        }
      }
    }
      break;

    case gecko_evt_mesh_config_client_binding_status_id:
    {
      struct gecko_msg_mesh_config_client_binding_status_evt_t *model_app_bind_status = (struct gecko_msg_mesh_config_client_binding_status_evt_t *)&(evt->data);
      if(state == waiting_bind_ack)
      {
        if(model_app_bind_status->result != STATUS_OK)
        {
          printf("evt: gecko_evt_mesh_config_client_binding_status_id, Bind an application key failed, error 0x%04x \r\n", model_app_bind_status->result);

          // if config failed, try again up to 5 times
          if (config_retrycount++ < 5) {
            printf("Not successful, will try again\r\n");
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_BIND, 1);
          }
          else
          {
            printf("ERROR: config failed, retry limit reached. stuck at state %d\r\n", state);
          }

        }
        else
        {
          config_retrycount = 0;
          printf("evt: gecko_evt_mesh_config_client_binding_status_id, Bind an application key successfully \r\n");

          _sConfig.num_bind_done++;

          if(_sConfig.num_bind_done < _sConfig.num_bind)
          {
            // more model<->appkey bindings to be done
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_APPKEY_BIND, 1);
          }
          else
          {
            // start PUB after finishing the appkey bind
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_PUB_SET, 1);
          }
        }
      }
    }
      break;


    case gecko_evt_mesh_config_client_model_pub_status_id:
    {
      struct gecko_msg_mesh_config_client_model_pub_status_evt_t *model_pub_status = (struct gecko_msg_mesh_config_client_model_pub_status_evt_t *)&(evt->data);

      if(state == waiting_pub_ack)
      {

        if(model_pub_status->result != STATUS_OK)
        {
          printf("evt: gecko_evt_mesh_config_client_model_pub_status_id, Set model publication addr failed, error 0x%04x \r\n", model_pub_status->result);

          // if config failed, try again up to 5 times
          if (config_retrycount++ < 5) {
            printf("Not successful, will try again\r\n");
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_PUB_SET, 1);
          }
          else
          {
            printf("ERROR: config failed, retry limit reached. stuck at state %d\r\n", state);
          }
        }
        else
        {
          config_retrycount = 0;

          printf("PUB complete\r\n");
          _sConfig.num_pub_done++;

          if(_sConfig.num_pub_done < _sConfig.num_pub)
          {
            // more publication settings to be done
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_PUB_SET, 1);
          }
          else
          {
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_SUB_ADD, 1);
          }
        }
      }

    }
      break;

    case gecko_evt_mesh_config_client_model_sub_status_id:
    {
      struct gecko_msg_mesh_config_client_model_sub_status_evt_t *model_sub_status = (struct gecko_msg_mesh_config_client_model_sub_status_evt_t *)&(evt->data);
      if(state == waiting_sub_ack)
      {
        if(model_sub_status->result != STATUS_OK)
        {
          printf("evt: gecko_evt_mesh_config_client_model_sub_status_id, Add model subscription failed, error 0x%04x \r\n", model_sub_status->result);

          // if config failed, try again up to 5 times
          if (config_retrycount++ < 5) {
            printf("Not successful, will try again\r\n");
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_SUB_ADD, 1);
          }
          else
          {
            printf("ERROR: config failed, retry limit reached. stuck at state %d\r\n", state);
          }

