sheldon123z/EFR32-embedded-provisioner/app.c
        }
        else
        {
          config_retrycount = 0;

          printf("SUB complete\r\n");
          _sConfig.num_sub_done++;
          if(_sConfig.num_sub_done < _sConfig.num_sub)
          {
            // more subscription settings to be done
            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_SUB_ADD, 1);
          }
          else
          {
            printf("***\r\n configuration complete\r\n***\r\n");
            state = scanning;


            uint16_t result_x;
            result_x = gecko_cmd_mesh_config_client_set_heartbeat_pub(netkey_id, provisionee_address, 0xF000, netkey_id, 0xFF, 0x02, 3, 0x007)->result;
			printf("Set heartbeat publication state of the node 0x%04x, result = 0x%04x\r\n", provisionee_address, result_x);


#ifdef REMOTE_ONOFF_CTL_FROM_PROV
            // If need to subscribe the message from switch node, bind and sub the group address here.
            uint8_t i = 0;

            /* If need to subscribe message from switch node or pub message to light node, bind and sub/pub the group address here.
            *
            * Below are the subscription and publication address Information
            *         PubAddr   SubAddr
            * Light   0xC002    0xC001
            * Switch  0xC001    0xC002
            *
            * If need to subscribe the message from Switch node, the provisioner's server model need to sub to 0xC001
            * If need to send control message to Light node, the provisioner's client model need to pub to 0xC001
            */

              /* Set the subscription */
            struct gecko_msg_mesh_generic_server_init_rsp_t *genericServerInitRsp = gecko_cmd_mesh_generic_server_init();
            printf("gecko_cmd_mesh_generic_server_init %x\n\r", genericServerInitRsp->result);

            struct gecko_msg_mesh_test_get_local_model_sub_rsp_t *sub_setting = gecko_cmd_mesh_test_get_local_model_sub(0, 0xFFFF, MESH_GENERIC_ON_OFF_SERVER_MODEL_ID);
            printf("gecko_cmd_mesh_test_get_local_model_sub result: %x sub_add_len: %d\r\n", sub_setting->result, sub_setting->addresses.len);

            for(i=0; i<sub_setting->addresses.len; i++)
              printf("gecko_cmd_mesh_test_get_local_model_sub sub_address: %x\r\n", sub_setting->addresses.data[i]);

            if (!sub_setting->result && (sub_setting->addresses.len != 0)) {
              // In fact, need to check the subscription address list here.
              printf("Subscription Configuration done already.\n");
            }
            else{
              //struct gecko_msg_mesh_test_add_local_key_rsp_t *addLocalKeyRsp = gecko_cmd_mesh_test_add_local_key(1, appKey, appkey_id, netkey_id);
              //printf("gecko_cmd_mesh_test_add_local_key %x\n\r", addLocalKeyRsp->result);

              struct gecko_msg_mesh_test_bind_local_model_app_rsp_t *bindLocalModelRsp = gecko_cmd_mesh_test_bind_local_model_app(0, appkey_id, 0xffff, MESH_GENERIC_ON_OFF_SERVER_MODEL_ID);
              printf("gecko_cmd_mesh_test_bind_local_model_app %x\n\r", bindLocalModelRsp->result);
              //subscribe to switch
              struct gecko_msg_mesh_test_add_local_model_sub_rsp_t *addLocalModelRsp = gecko_cmd_mesh_test_add_local_model_sub(0, 0xffff, MESH_GENERIC_ON_OFF_SERVER_MODEL_ID, 0xC001);
              printf("gecko_cmd_mesh_test_add_local_model_sub %x\n\r", addLocalModelRsp->result);

            }

            /* Set the publication */
            struct gecko_msg_mesh_generic_client_init_rsp_t *genericClientInitRsp = gecko_cmd_mesh_generic_client_init();
            printf("gecko_cmd_mesh_generic_client_init %x\n\r", genericClientInitRsp->result);

            struct gecko_msg_mesh_test_get_local_model_pub_rsp_t *pub_setting = gecko_cmd_mesh_test_get_local_model_pub(0, 0xFFFF, MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID);
            printf("gecko_cmd_mesh_test_get_local_model_pub result: %x\r\n", pub_setting->result);
            printf("gecko_cmd_mesh_test_get_local_model_pub pub_address: 0x%04x\r\n", pub_setting->pub_address);

            if (!sub_setting->result && (pub_setting->pub_address != 0)) {
              printf("Publication Configuration done already.\n");
            }
            else{
              struct gecko_msg_mesh_test_bind_local_model_app_rsp_t *bindLocalModelRsp = gecko_cmd_mesh_test_bind_local_model_app(0, appkey_id, 0xffff, MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID);
              printf("gecko_cmd_mesh_test_bind_local_model_app %x\n\r", bindLocalModelRsp->result);

              //publish to Light
              struct gecko_msg_mesh_test_set_local_model_pub_rsp_t *setLocalModelPubRsp = gecko_cmd_mesh_test_set_local_model_pub(0, appkey_id, 0xffff, MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID, 0xC001, 5, 0, 0, 0);
              printf("gecko_cmd_mesh_test_set_local_model_pub %x\n\r", setLocalModelPubRsp->result);

              //subscribe to light, light is server so here should be MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID
              struct gecko_msg_mesh_test_add_local_model_sub_rsp_t *addLocalModelRspX = gecko_cmd_mesh_test_add_local_model_sub(0, 0xffff, MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID, 0xC002);
              printf("gecko_cmd_mesh_test_add_local_model_sub %x\n\r", addLocalModelRspX->result);
            }

            // ------------------------------------------ //
            printf("---------------- Dump sub/pub infor here ----------------\r\n");
            sub_setting = gecko_cmd_mesh_test_get_local_model_sub(0, 0xFFFF, MESH_GENERIC_ON_OFF_SERVER_MODEL_ID);
            for(i=0; i<sub_setting->addresses.len; (i=i+2))
              printf("gecko_cmd_mesh_test_get_local_model_sub onoff server model sub_address: 0x%02x%02x\r\n", sub_setting->addresses.data[i+1], sub_setting->addresses.data[i]);

            sub_setting = gecko_cmd_mesh_test_get_local_model_sub(0, 0xFFFF, MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID);
            for(i=0; i<sub_setting->addresses.len; (i=i+2))
              printf("gecko_cmd_mesh_test_get_local_model_sub onoff client model sub_address: 0x%02x%02x\r\n", sub_setting->addresses.data[i+1], sub_setting->addresses.data[i]);

            pub_setting = gecko_cmd_mesh_test_get_local_model_pub(0, 0xFFFF, MESH_GENERIC_ON_OFF_CLIENT_MODEL_ID);
            printf("gecko_cmd_mesh_test_get_local_model_pub pub_address: 0x%04x\r\n", pub_setting->pub_address);
            printf("---------------------------------------------------------\r\n");

            // uncomment it if need to control the light node from the provisioner
//            gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(5000), TIMER_ID_SEND_PUB_MSG, 0);
  #endif


