sheldon123z/EFR32-embedded-provisioner/app.c
          }
        }
      }
    }
      break;

    case gecko_evt_mesh_config_client_heartbeat_pub_status_id:
    {
    	struct gecko_msg_mesh_config_client_heartbeat_pub_status_evt_t *hbPubStatus = (struct gecko_msg_mesh_config_client_heartbeat_pub_status_evt_t *)&(evt->data);
    	printf("evt gecko_evt_mesh_config_client_heartbeat_pub_status_id, result 0x%04x, adr 0x%04x, netkey_index %d, count %d, period %d, ttl %d, features 0x%04x \r\n",
    			hbPubStatus->result,
				hbPubStatus->destination_address,
				hbPubStatus->netkey_index,
				hbPubStatus->count_log,
				hbPubStatus->period_log,
				hbPubStatus->ttl,
				hbPubStatus->features);
    }
    	break;

    case gecko_evt_le_gap_adv_timeout_id:
      // adv timeout events silently discarded
      break;

    case gecko_evt_le_connection_opened_id:
      printf("evt:gecko_evt_le_connection_opened_id\r\n");
      num_connections++;
      conn_handle = evt->data.evt_le_connection_opened.connection;
      LCD_write("connected", LCD_ROW_CONNECTION);

      if(state == connecting)
      {
        printf("connection opened, proceeding provisioning over GATT\r\n");
        struct gecko_msg_mesh_prov_provision_gatt_device_rsp_t *prov_resp_adv;
        prov_resp_adv = gecko_cmd_mesh_prov_provision_gatt_device(netkey_id, conn_handle, 16, _uuid_copy);

        if (prov_resp_adv->result == 0) {
          printf("Successful call of gecko_cmd_mesh_prov_provision_gatt_device\r\n");
          state = provisioning;
        } else {
          printf("Failed call to gatt provision node. %x\r\n", prov_resp_adv->result);
        }
      }
      break;

    case gecko_evt_le_connection_parameters_id:
      printf("evt:gecko_evt_le_connection_parameters_id\r\n");
      break;

    case gecko_evt_le_connection_closed_id:
      printf("evt:conn closed, reason 0x%x\r\n", evt->data.evt_le_connection_closed.reason);
      conn_handle = 0xFF;
      if (num_connections > 0) {
        if (--num_connections == 0) {
          LCD_write("", LCD_ROW_CONNECTION);
        }
      }
      break;

    case gecko_evt_gatt_server_user_write_request_id:
      break;

    case gecko_evt_system_external_signal_id:
      {
	  if (evt->data.evt_system_external_signal.extsignals & EXTERNAL_SIGNAL_LIGHT_ON) {
			  ///write commands handler here
		  	  handle_turn_onoff_event(Light_state);
			}
	  if (evt->data.evt_system_external_signal.extsignals & EXTERNAL_SIGNAL_LIGHT_OFF) {
			  ///write commands handler here
		  	  handle_turn_onoff_event(Light_state);
			}
	  if (evt->data.evt_system_external_signal.extsignals & EXTERNAL_SIGNAL_SWITCH_ON) {
	  			  ///write commands handler here
	  		  	  handle_turn_switch_onoff_command(Light_state);
	  			}
	  	  if (evt->data.evt_system_external_signal.extsignals & EXTERNAL_SIGNAL_SWITCH_OFF) {
	  			  ///write commands handler here
	  		  	  handle_turn_switch_onoff_command(Light_state);
	  			}
	  /*add as many as the number of command handler as you want below*/
      }
      break;

    case gecko_evt_mesh_prov_initialized_id:
    {
      struct gecko_msg_mesh_prov_initialized_evt_t *initialized_evt;
      initialized_evt = (struct gecko_msg_mesh_prov_initialized_evt_t *)&(evt->data);

      printf("gecko_cmd_mesh_prov_init_id\r\n");
      printf("networks: %x\r\n", initialized_evt->networks);
      printf("address: %x\r\n", initialized_evt->address);
      printf("ivi: %x\r\n", (unsigned int)initialized_evt->ivi);

      LCD_write("provisioner", LCD_ROW_STATUS);

      if (initialized_evt->networks > 0) {
        printf("network keys already exist\r\n");
        netkey_id = 0;
        appkey_id = 0;
      } else {
        printf("Creating a new netkey\r\n");

        struct gecko_msg_mesh_prov_create_network_rsp_t *new_netkey_rsp;
#ifdef USE_FIXED_KEYS
        new_netkey_rsp = gecko_cmd_mesh_prov_create_network(16, fixed_netkey);
#else
        new_netkey_rsp = gecko_cmd_mesh_prov_create_network(0, (const uint8 *)"");
#endif

        if (new_netkey_rsp->result == 0) {
          netkey_id = new_netkey_rsp->network_id;
          printf("Success, netkey id = %x\r\n", netkey_id);
        } else {
          printf("Failed to create new netkey. Error: %x", new_netkey_rsp->result);
        }

        printf("Creating a new appkey\r\n");

        struct gecko_msg_mesh_prov_create_appkey_rsp_t *new_appkey_rsp;

#ifdef USE_FIXED_KEYS
        new_appkey_rsp = gecko_cmd_mesh_prov_create_appkey(netkey_id, 16, fixed_appkey);
#else
        new_appkey_rsp = gecko_cmd_mesh_prov_create_appkey(netkey_id, 0, (const uint8 *)"");
#endif

        if (new_netkey_rsp->result == 0) {
          appkey_id = new_appkey_rsp->appkey_index;
          printf("Success, appkey_id = %x\r\n", appkey_id);
          printf("Appkey: ");
          for (uint32_t i = 0; i < new_appkey_rsp->key.len; ++i) {
            printf("%02x ", new_appkey_rsp->key.data[i]);
          }
          printf("\r\n");
        } else {
          printf("Failed to create new appkey. Error: %x", new_appkey_rsp->result);
        }
      }

      printf("List all of the nodes known by the provisioner \r\n");
      struct gecko_msg_mesh_prov_ddb_list_devices_rsp_t *listDDB_rsp;
      listDDB_rsp = gecko_cmd_mesh_prov_ddb_list_devices();
      if (listDDB_rsp->result == 0) {
        printf("Success - list nodes\r\n");
      } else {
        printf("Failure - list nodes, result 0x%04x\r\n", listDDB_rsp->result);
      }

      printf("Starting to scan for unprovisioned device beacons\r\n");

      struct gecko_msg_mesh_prov_scan_unprov_beacons_rsp_t *scan_rsp;
      scan_rsp = gecko_cmd_mesh_prov_scan_unprov_beacons();

      if (scan_rsp->result == 0) {
        printf("Success - initializing unprovisioned beacon scan\r\n");
        state = scanning;
      } else {
        printf("Failure initializing unprovisioned beacon scan. Result: %x\r\n", scan_rsp->result);
      }

      // start timer for button polling
       gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(100), TIMER_ID_SYS_BUTTON_POLL, 0);

      break;
    }

    case gecko_evt_mesh_prov_ddb_list_id:
      printf("evt: gecko_evt_mesh_prov_ddb_list_id address 0x%04x, element %d\r\n", evt->data.evt_mesh_prov_ddb_list.address, evt->data.evt_mesh_prov_ddb_list.elements);
      break;

    case gecko_evt_mesh_prov_unprov_beacon_id:
    {
      struct gecko_msg_mesh_prov_unprov_beacon_evt_t *beacon_evt = (struct gecko_msg_mesh_prov_unprov_beacon_evt_t *)&(evt->data);
      int i;
      if ((state == scanning) && (ask_user_input == false)) {
      printf("gecko_evt_mesh_prov_unprov_beacon_id\r\n");

      for(i=0;i<beacon_evt->uuid.len;i++)
      {
        printf("%2.2x", beacon_evt->uuid.data[i]);
      }

      // show also the same shortened version that is used on the LCD of switch / light examples
      printf(" (%2.2x %2.2x)", beacon_evt->uuid.data[11], beacon_evt->uuid.data[10]);
      printf("\r\n");

      memcpy(_uuid_copy, beacon_evt->uuid.data, 16);
#ifdef PROVISION_OVER_GATT
      bt_address = beacon_evt->address;
      bt_address_type = beacon_evt->address_type;
#endif
      printf("confirm?\r\n");
      // suspend reporting of unprov beacons until user has rejected or accepted this one using buttons PB0 / PB1
      ask_user_input = true;
      }
      break;
    }

