sheldon123z/EFR32-embedded-provisioner/app.c
    case gecko_evt_mesh_prov_provisioning_failed_id:
    {
      struct gecko_msg_mesh_prov_provisioning_failed_evt_t *fail_evt = (struct gecko_msg_mesh_prov_provisioning_failed_evt_t*)&(evt->data);

      printf("Provisioning failed. Reason: %x\r\n", fail_evt->reason);
      state = scanning;

      break;
    }

    case gecko_evt_mesh_prov_device_provisioned_id:
    {
      struct gecko_msg_mesh_prov_device_provisioned_evt_t *prov_evt = (struct gecko_msg_mesh_prov_device_provisioned_evt_t*)&(evt->data);

      printf("Node successfully provisioned. Address: %4.4x\r\n", prov_evt->address);
      state = provisioned;

      printf("provisioning done - uuid 0x");
      for (uint8_t i = 0; i < prov_evt->uuid.len; i++) printf("%02X", prov_evt->uuid.data[i]);
      printf("\r\n");

      provisionee_address = prov_evt->address;

      /* kick of next phase which is reading DCD from the newly provisioned node */
      gecko_cmd_hardware_set_soft_timer(TIMER_MS_2_TIMERTICK(500), TIMER_ID_GET_DCD, 1);

      break;
    }

    case gecko_evt_mesh_generic_server_client_request_id:
    {
      struct gecko_msg_mesh_generic_server_client_request_evt_t *genericRequestEvt = (struct gecko_msg_mesh_generic_server_client_request_evt_t*)&(evt->data);
      printf("evt gecko_evt_mesh_generic_server_client_request_id: client_addr 0x%04x server_addr 0x%04x\r\n", genericRequestEvt->client_address, genericRequestEvt->server_address);
	  printf("Received status from Switch:0x%04x\r\n",genericRequestEvt->server_address);
	  printf("evt gecko_evt_mesh_generic_client_server_status_id, elem_index 0x%04x\r\n, client_adr 0x%04x\r\n, server_adr 0x%04x\r\n, type 0x%02x\r\n, len %d\r\n, data 0x%02x\r\n",
				genericRequestEvt->elem_index,
				genericRequestEvt->client_address,
				genericRequestEvt->server_address,
				genericRequestEvt->type,
				genericRequestEvt->parameters.len,
				genericRequestEvt->parameters.data[0]);
//		char *onoff;
//
//		if(genericRequestEvt->parameters.data[0] == 0x01)
//			onoff = "ON";
//		else
//			onoff = "OFF";
//
//		  char *packet = createControlCommandPacket(Lights ,"Lights",ON_OFF,"ON_OFF",onoff);
//		  sendPacket(packet);

      break;
    }

    case gecko_evt_mesh_generic_server_state_changed_id:
    {
      // uncomment following line to get debug prints for each server state changed event
      server_state_changed(&(evt->data.evt_mesh_generic_server_state_changed));

      break;
    }
    case gecko_evt_mesh_generic_client_server_status_id:
    {
    	struct gecko_msg_mesh_generic_client_server_status_evt_t *genericClientServerStaEvt = (struct gecko_msg_mesh_generic_client_server_status_evt_t*)&(evt->data);

    	printf("Received status from Lights:0x%04x\r\n",genericClientServerStaEvt->server_address);
    	printf("evt gecko_evt_mesh_generic_client_server_status_id, elem_index 0x%04x,\r\n client_adr 0x%04x,\r\n server_adr 0x%04x,\r\n type 0x%02x,\r\n len %d,\r\n data 0x%02x\r\n",
    			genericClientServerStaEvt->elem_index,
				genericClientServerStaEvt->client_address,
				genericClientServerStaEvt->server_address,
				genericClientServerStaEvt->type,
				genericClientServerStaEvt->parameters.len,
				genericClientServerStaEvt->parameters.data[0]);
    	char *onoff;

    	if(genericClientServerStaEvt->parameters.data[0] == 0x01)
    		onoff = "ON";
    	else
    		onoff = "OFF";

        char *packet = createControlCommandPacket(Lights ,"Lights",ON_OFF,"ON_OFF",onoff);
        sendPacket(packet);
        break;
    }

    default:
      printf("unhandled evt: %8.8x class %2.2x method %2.2x\r\n", (unsigned int)evt_id, (unsigned int)((evt_id >> 16) & 0xFF), (unsigned int)((evt_id >> 24) & 0xFF));
      break;
  }
}

/** @} (end addtogroup app) */
/** @} (end addtogroup Application) */
